* Description
You are given a map in form of a two-dimensional integer grid where 1 represents land and 0 represents water. Grid cells are connected horizontally/vertically (not diagonally). The grid is completely surrounded by water, and there is exactly one island (i.e., one or more connected land cells). The island doesn't have "lakes" (water inside that isn't connected to the water around the island). One cell is a square with side length 1. The grid is rectangular, width and height don't exceed 100. Determine the perimeter of the island.

Example:

[[0,1,0,0],
 [1,1,1,0],
 [0,1,0,0],
 [1,1,0,0]]
Answer: 16
Explanation: The perimeter is the 16 yellow stripes in the image below:
* Solution
#+BEGIN_SRC cpp
  #include <algorithm>
  #include <iostream>
  #include <vector>
  using namespace std;

  class Solution {
  public:
    int islandPerimeter(vector<vector<int>> &grid) {
      int rv = 0;
      for (size_t i = 0; i < grid.size(); i++) {
        for (size_t j = 0; j < grid[i].size(); j++) {
          if (grid[i][j] == 1) {
            rv += 4;
            if (i < grid.size() - 1 && grid[i + 1][j] == 1) {
              rv -= 2;
            }
            if (j < grid[i].size() - 1 && grid[i][j + 1] == 1) {
              rv -= 2;
            }
          }
        }
      }
      return rv;
    }
  };

  int main(int argc, char *argv[]) {
    Solution solution = Solution();
    // vector<vector<int>> n = {
    //     {0, 1, 0, 0}, {1, 1, 1, 0}, {0, 1, 0, 0}, {1, 1, 0, 0}};
    vector<vector<int>> n = {{1,1,1}, {1,0,1}};
    cout << solution.islandPerimeter(n) << endl;
    return 0;
  }
#+END_SRC

#+RESULTS:
: 12
